export const useFlagCodes: any = {
  U: '유효',
  C: '취소',
  D: '삭제',
  H: '이력',
};

export const stateCodes: any = {
  '00': '신규',
  '01': '처리중',
  '10': '정상',
  '20': '오류',
};

export const scopeCodes: any = {
  AS: '요청',
  CA: '취소',
  RA: '재요청',
  FI: '완료',
  PS: '진행정보',
  SY: '즉시응답',
};

export const detailCodes: any = {
  '1200': '소유권이전',
  '2810': '근저당권설정',
  '2850': '근저당권말소',
  '2820': '근저당권이전',
  '2110': '지상권설정',
  '2150': '지상권말소',
  '2910': '질권설정',
  '2950': '질권말소',
  '2830': '근저당권변경',
  '7110': '등기명의인표시변경',
  '7210': '등기명의인표시경정',
};

export const catCodes: any = {
  'SC-00': '웹소켓 로그인',
  'SC-01': '웹소켓 로그인',
  'SC-02': '웹소켓 로그인',
  'SC-10': 'RPA 상태조회',
  'SC-11': 'RPA 재실행',
  'SC-20': '정보 조회',
  'SC-21': '결과 없음',
  'SC-30': '검증요청',
  'SC-31': '검증 정상',
  'SC-32': '검증 오류',
  'IR-00': '전자신청',
  'IR-01': '이폼신청',
  'IR-02': '표시작성',
  'IR-10': '신청서제출',
  'IR-11': '신청서 출력',
  'IR-12': '수수료 결제',
  'IR-20': '처리현황 검색',
  'IR-21': '진행사건 검색',
  'IR-23': '등기필수령',
  'IR-24': '접수 검증',
  'IR-30': '열람',
  'IR-40': '고유번호 조회',
  'IR-41': '주소 조회',
  'IR-50': '인감 등록',
  'IR-52': '등기필정보 조회',
  'WT-00': '등록세신고',
  'WT-10': '납세정보 조회',
};
